// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "À propos de Chrome OS Image Creator";
"Menu Prefs" = "Préférences…";
"Menu Services" = "Services";
"Menu Hide" = "Masquer Chrome OS Image Creator";
"Menu Hide Others" = "Masquer les autres";
"Menu Show All" = "Tout afficher";
"Menu Quit" = "Quitter Chrome OS Image Creator";
"Menu Window" = "Fenêtre";
"Menu Minimize" = "Réduire";
"Menu Zoom" = "Zoom";
"Menu Bring All To Front" = "Tout ramener au premier plan";
"Menu Help" = "Aide";
"Menu App Help" = "Aide Chrome OS Image Creator";

/* Buttons */
"Button Previous" = "Précédent";
"Button Next" = "Suivant";
"Button Stop" = "Arrêter";
"Button Done" = "OK";

/* Tab: Select device model */
"Text Welcome" = "Bienvenue dans Chrome OS Image Creator ! Veuillez sélectionner le modèle de périphérique Chrome OS que vous utilisez.";
"Button Local Image" = "Image locale… ";

/* Tab: Select USB stick */
"Text Select Prompt" = "Sélectionnez la clé USB à utiliser pour la restauration :";
"Text Insertion Prompt" = "Veuillez insérer une clé USB.";

/* Tab: Done */
"Text Congrats" = "Félicitations, vous avez créé un lecteur de démarrage pour restaurer votre machine Chrome OS. Veuillez le retirer de votre ordinateur et l'utiliser pour restaurer le système d'exploitation endommagé de votre Chromebook.";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Cette application ne peut pas être exécutée.";
"NoDiskArb Informative" = "Un problème est survenu au démarrage du processus d'arbitrage de disque. Cette erreur ne doit pas se produire.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Impossible d'extraire la liste d'images.";
"CantGetConfig Informative" = "Un problème est survenu lors de l'extraction de la liste d'images de récupération disponibles (%1$@). Veuillez vérifier que votre connexion réseau fonctionne.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "impossible d'allouer une connexion";
"CantGetConfig Error DownloadError" = "une erreur s'est produite lors du téléchargement";
"CantGetConfig Error StringCreate" = "la réponse n'a pas pu être utilisée";

/* Version error. */
"VersionError Message" = "Cette version de l'application est trop ancienne.";
"VersionError Informative" = "Veuillez télécharger une version plus récente. Il s'agit de la version %1$@ ; la version %2$@ est requise au minimum. %3$@";
"VersionError OK" = "Obtenir la nouvelle version";

/* File dialog to select a local file. */
"SelectLocal File" = "Veuillez sélectionner une image :";
"SelectLocal Button" = "Sélectionner";

/* Alert on writing stick. */
"WriteAlert Message" = "Voulez-vous vraiment effacer de façon permanente le contenu de la clé USB %1$@ ?";
"WriteAlert Informative" = "Toutes les données qu'elle contient seront définitivement perdues. Vous ne pouvez pas annuler cette action.";
"WriteAlert Cancel" = "Ne pas effacer";
"WriteAlert OK" = "Effacer";

"TooSmallAlert Message" = "Impossible d'utiliser la clé USB %1$@. Sa capacité est insuffisante.";
"TooSmallAlert Informative" = "Une clé d'environ %2$@ est requise.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Impossible d'utiliser la clé USB %1$@ ; elle est en lecture seule.";
"NotWritable Informative" = "La clé est en lecture seule. Un loquet permet peut-être de supprimer la protection en écriture. Si tel n'est pas le cas, la clé ne peut pas être utilisée.";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "Téléchargement en cours…";
"Status Verifying" = "Vérification en cours…";
"Status Unpacking" = "Décompression en cours…";
"Status Claiming" = "Demande en cours…";
"Status Unmounting" = "Démontage en cours…";
"Status Writing" = "Écriture en cours…";
"Status Ejecting" = "Éjection en cours…";
"Status Done" = "OK";

"StatusAdd Attempt" = " (tentative %1$d)";

/* Errors */
"Failure Downloading" = "Désolé, une erreur s'est produite (impossible de télécharger l'image source). Voulez-vous réessayer ?";
"Failure Verifying Return Value" = "Désolé, une erreur s'est produite (impossible de vérifier l'image source, échec du programme, %1$s). Voulez-vous réessayer ?";
"Failure Verifying SHA Mismatch" = "Désolé, une erreur s'est produite (impossible de vérifier l'image source, échec de la génération du total de contrôle). Voulez-vous réessayer ?";
"Failure Unpacking" = "Désolé, une erreur s'est produite (impossible de décompresser l'image source, %1$s). Voulez-vous réessayer ?";
"Failure Claiming" = "Désolé, une erreur s'est produite (impossible de demander la clé USB). Voulez-vous réessayer ?";
"Failure Unmounting" = "Désolé, une erreur s'est produite (impossible de démonter la clé USB). Voulez-vous réessayer ?";
"Failure Opening Source Image" = "Désolé, une erreur s'est produite (impossible d'ouvrir l'image source, %1$s). Voulez-vous réessayer ?";
"Failure Opening Destination Device" = "Désolé, une erreur s'est produite (impossible d'ouvrir la clé USB, %1$s). Voulez-vous réessayer ?";
"Failure Reading Source Image" = "Désolé, une erreur s'est produite (impossible de lire l'image source, %1$s). Voulez-vous réessayer ?";
"Failure Writing Destination Device" = "Désolé, une erreur s'est produite (impossible d'écrire des données sur la clé USB, %1$s). Voulez-vous réessayer ?";
"Failure Ejecting" = "Désolé, une erreur s'est produite (impossible d'éjecter la clé USB). Voulez-vous réessayer ?";

"Failure Try Again" = "Réessayer";
"Failure Quit" = "Quitter";

"Failure Termination Status" = "État de fin %d";

"Failure Internal Error 1" = "Fin de fichier (EOF) inattendue";
